esphome/esphome/esphome/components/esp32_ble/ble.cpp
#ifdef USE_ESP32_BLE_CLIENT
void ESP32BLE::gattc_event_handler(esp_gattc_cb_event_t event, esp_gatt_if_t gattc_if,
                                   esp_ble_gattc_cb_param_t *param) {
  enqueue_ble_event(event, gattc_if, param);
}
#endif

float ESP32BLE::get_setup_priority() const { return setup_priority::BLUETOOTH; }

void ESP32BLE::dump_config() {
  const uint8_t *mac_address = esp_bt_dev_get_address();
  if (mac_address) {
    const char *io_capability_s;
    switch (this->io_cap_) {
      case ESP_IO_CAP_OUT:
        io_capability_s = "display_only";
        break;
      case ESP_IO_CAP_IO:
        io_capability_s = "display_yes_no";
        break;
      case ESP_IO_CAP_IN:
        io_capability_s = "keyboard_only";
        break;
      case ESP_IO_CAP_NONE:
        io_capability_s = "none";
        break;
      case ESP_IO_CAP_KBDISP:
        io_capability_s = "keyboard_display";
        break;
      default:
        io_capability_s = "invalid";
        break;
    }
    ESP_LOGCONFIG(TAG,
                  "BLE:\n"
                  "  MAC address: %s\n"
                  "  IO Capability: %s",
                  format_mac_address_pretty(mac_address).c_str(), io_capability_s);
  } else {
    ESP_LOGCONFIG(TAG, "Bluetooth stack is not enabled");
  }
}

#ifdef USE_SOCKET_SELECT_SUPPORT
void ESP32BLE::setup_event_notification_() {
  // Create UDP socket for event notifications
  this->notify_fd_ = lwip_socket(AF_INET, SOCK_DGRAM, IPPROTO_UDP);
  if (this->notify_fd_ < 0) {
    ESP_LOGW(TAG, "Event socket create failed: %d", errno);
    return;
  }

  // Bind to loopback with auto-assigned port
  struct sockaddr_in addr = {};
  addr.sin_family = AF_INET;
  addr.sin_addr.s_addr = lwip_htonl(INADDR_LOOPBACK);
  addr.sin_port = 0;  // Auto-assign port

  if (lwip_bind(this->notify_fd_, (struct sockaddr *) &addr, sizeof(addr)) < 0) {
    ESP_LOGW(TAG, "Event socket bind failed: %d", errno);
    lwip_close(this->notify_fd_);
    this->notify_fd_ = -1;
    return;
  }

  // Get the assigned port for sendto()
  socklen_t len = sizeof(this->notify_addr_);
  if (lwip_getsockname(this->notify_fd_, (struct sockaddr *) &this->notify_addr_, &len) < 0) {
    ESP_LOGW(TAG, "Event socket address failed: %d", errno);
    lwip_close(this->notify_fd_);
    this->notify_fd_ = -1;
    return;
  }

  // Set non-blocking mode
  int flags = lwip_fcntl(this->notify_fd_, F_GETFL, 0);
  lwip_fcntl(this->notify_fd_, F_SETFL, flags | O_NONBLOCK);

  // Register with application's select() loop
  if (!App.register_socket_fd(this->notify_fd_)) {
    ESP_LOGW(TAG, "Event socket register failed");
    lwip_close(this->notify_fd_);
    this->notify_fd_ = -1;
    return;
  }

  ESP_LOGD(TAG, "Event socket ready");
}

void ESP32BLE::cleanup_event_notification_() {
  // Guard against multiple calls (reentrant safety for ble.disable automation)
  if (this->notify_fd_ < 0) {
    return;  // Already cleaned up
  }

  App.unregister_socket_fd(this->notify_fd_);
  lwip_close(this->notify_fd_);
  this->notify_fd_ = -1;
  ESP_LOGD(TAG, "Event socket closed");
}

void ESP32BLE::notify_main_loop_() {
  // Called from BLE thread context when events are queued
  // Wakes up lwip_select() in main loop by writing to loopback socket
  if (this->notify_fd_ >= 0) {
    const char dummy = 1;
    // Non-blocking sendto - if it fails (unlikely), select() will wake on timeout anyway
    // This is safe to call from BLE thread - sendto() is thread-safe in lwip
    lwip_sendto(this->notify_fd_, &dummy, 1, 0, (struct sockaddr *) &this->notify_addr_, sizeof(this->notify_addr_));
  }
}

void ESP32BLE::drain_event_notifications_() {
  // Called from main loop to drain any pending notifications
  // Must check is_socket_ready() to avoid blocking on empty socket
  if (this->notify_fd_ >= 0 && App.is_socket_ready(this->notify_fd_)) {
    char buffer[64];
    // Drain all pending notifications with non-blocking reads
    // Multiple BLE events may have triggered multiple writes, so drain until EWOULDBLOCK
    while (lwip_recvfrom(this->notify_fd_, buffer, sizeof(buffer), 0, nullptr, nullptr) > 0) {
      // Just draining, no action needed
    }
  }
}
#endif  // USE_SOCKET_SELECT_SUPPORT

uint64_t ble_addr_to_uint64(const esp_bd_addr_t address) {
  uint64_t u = 0;
  u |= uint64_t(address[0] & 0xFF) << 40;
  u |= uint64_t(address[1] & 0xFF) << 32;
  u |= uint64_t(address[2] & 0xFF) << 24;
  u |= uint64_t(address[3] & 0xFF) << 16;
  u |= uint64_t(address[4] & 0xFF) << 8;
  u |= uint64_t(address[5] & 0xFF) << 0;
  return u;
}

ESP32BLE *global_ble = nullptr;  // NOLINT(cppcoreguidelines-avoid-non-const-global-variables)

}  // namespace esphome::esp32_ble

#endif
